let lines_list = [
	{name: "ВЛ 750 кВ Ленинградская АЭС – Ленинградская", start: "НСС Ленинградской АЭС", end: "ДИ ПС 750 кВ Ленинградская"},
	{name: "ВЛ 750 кВ Белозерская – Ленинградская", start: "ДД Диспетчера ЦДУ", end: "ДИ ПС 750 кВ Ленинградская"},
	{name: "ВЛ 750 кВ Калининская АЭС – Ленинградская", start: "ДД  Диспетчера ЦДУ", end: "ДИ ПС 750 кВ Ленинградская"},
	{name: "КВЛ 330 кВ Балти – Кингисеппская (Л-374)", start: "ДД Elering AS", end: "ДИ ПС 330 кВ Кингисеппская"},
	{name: "ВЛ 330 кВ Бологое – Окуловская", start: "ДД Тверского РДУ", end: "ДИ ПС 330 кВ Окуловская"},
	{name: "ВЛ 330 кВ Великорецкая – Резекне (Л 309)", start: "ДД  Новгородского РДУ", end: "ДД Augstsprieguma tikls"},
	{name: "ВЛ 330 кВ Виру – Кингисеппская (ВЛ 373)", start: "ДД Elering AS", end: "ДИ ПС 330 кВ Кингисеппская"},
	{name: "КЛ 330 кВ Волхов-Северная – Завод Ильич №1", start: "ДИ ПС 330 кВ Волхов-Северная", end: "ДИ ПС 330 кВ Завод Ильич"},
	{name: "КЛ 330 кВ Волхов-Северная – Завод Ильич №2", start: "ДИ ПС 330 кВ Волхов-Северная", end: "ДИ ПС 330 кВ Завод Ильич"},
	{name: "КВЛ 330 кВ Восточная – Волхов-Северная №1", start: "ДИ ПС 330 кВ Восточная", end: "ДИ ПС 330 кВ Волхов-Северная"},
	{name: "КВЛ 330 кВ Восточная – Волхов-Северная №2", start: "ДИ ПС 330 кВ Восточная", end: "ДИ ПС 330 кВ Волхов-Северная"},
	{name: "ВЛ 330 кВ Восточная – Выборгская I цепь", start: "ДИ ПС 330 кВ Восточная", end: "ДИ ПС 400 кВ Выборгская"},
	{name: "ВЛ 330 кВ Восточная – Выборгская II цепь", start: "ДИ ПС 330 кВ Восточная", end: "ДИ ПС 400 кВ Выборгская"},
	{name: "КВЛ 330 кВ Восточная – Колпино I цепь", start: "ДИ ПС 330 кВ Восточная", end: "ДИ ПС 330 кВ Колпино"},
	{name: "ВЛ 330 кВ Восточная – Колпино II цепь", start: "ДИ ПС 330 кВ Восточная", end: "ДИ ПС 330 кВ Колпино"},
	{name: "ВЛ 330 кВ Восточная – Октябрьская I цепь", start: "ДИ ПС 330 кВ Восточная", end: "ДД Ленинградского РДУ"},
	{name: "ВЛ 330 кВ Восточная – Октябрьская II цепь", start: "ДИ ПС 330 кВ Восточная", end: "ДД Ленинградского РДУ"},
	{name: "КВЛ 330 кВ Восточная – Парнас", start: "ДИ ПС 330 кВ Восточная", end: "ДИ ПС 330 кВ Парнас"},
	{name: "КВЛ 330 кВ Восточная – Ржевская I цепь", start: "ДИ ПС 330 кВ Восточная", end: "ДИ ПС 330 кВ Ржевская"},
	{name: "КВЛ 330 кВ Восточная – Ржевская II цепь", start: "ДИ ПС 330 кВ Восточная", end: "ДИ ПС 330 кВ Ржевская"},
	{name: "ВЛ 330 кВ Восточная – Южная", start: "ДИ ПС 330 кВ Восточная", end: "ДИ ПС 330 кВ Южная"},
	{name: "ВЛ 330 кВ Выборгская – Каменногорская", start: "ДИ ПС 400 кВ Выборгская", end: "ДИ ПС 330 кВ Каменногорская"},
	{name: "ВЛ 400 кВ Выборгская – Кюми (ЛЛн-1)", start: "ДИ ПС 400 кВ Выборгская", end: "ДД Fingrid"},
	{name: "ВЛ 400 кВ Выборгская – Юлликкяля (ЛЛн-2)", start: "ДИ ПС 400 кВ Выборгская", end: "ДД Fingrid"},
	{name: "ВЛ 400 кВ Выборгская – Юлликкяля (ЛЛн-3)", start: "ДИ ПС 400 кВ Выборгская", end: "ДД Fingrid"},
	{name: "ВЛ 330 кВ Гатчинская – Кингисеппская", start: "ДИ ПС 330 кВ Гатчинская", end: "ДИ ПС 330 кВ Кингисеппская"},
	{name: "ВЛ 330 кВ Гатчинская – Лужская", start: "ДИ ПС 330 кВ Гатчинская", end: "ДИ ПС 330 кВ Лужская"},
	{name: "ВЛ 330 кВ Гатчинская – Южная", start: "ДИ ПС 330 кВ Гатчинская", end: "ДИ ПС 330 кВ Южная"},
	{name: "КЛ 330 кВ Завод Ильич – Василеостровская", start: "ДИ ПС 330 кВ Завод Ильич", end: "ДИ ПС 330 кВ Василеостровская"},
	{name: "КВЛ 330 кВ Западная – Пулковская", start: "ДИ ПС 330 кВ Западная", end: "ДИ ПС 330 кВ Пулковская"},
	{name: "ВЛ 330 кВ Зеленогорск – Каменногорская", start: "ДИ ПС 330 кВ Зеленогорск", end: "ДИ ПС 330 кВ Каменногорская"},
	{name: "ВЛ 330 кВ Кингисеппская – Псков", start: "ДИ ПС 330 кВ Кингисеппская", end: "ДД Новгородского РДУ"},
	{name: "КВЛ 330 кВ Киришская ГРЭС – Восточная I цепь", start: "ДИ Киришской ГРЭС", end: "ДИ ПС 330 кВ Восточная"},
	{name: "ВЛ 330 кВ Киришская ГРЭС – Восточная II цепь", start: "НСС Киришской ГРЭС", end: "ДИ ПС 330 кВ Восточная"},
	{name: "ВЛ 330 кВ Киришская ГРЭС – Сясь", start: "НСС Киришской ГРЭС", end: "ДИ ПС 330 кВ Сясь"},
	{name: "ВЛ 330 кВ Киришская ГРЭС – Тихвин-Литейный", start: "НСС Киришской ГРЭС", end: "ДИ ПС 330 кВ Тихвин-Литейный"},
	{name: "ВЛ 330 кВ Киришская ГРЭС – Чудово", start: "НСС Киришской ГРЭС", end: "ДД Новгородского РДУ"},
	{name: "ВЛ 330 кВ Копорская – Гатчинская", start: "ДИ ПС 750 кВ Копорская", end: "ДИ ПС 330 кВ Гатчинская"},
	{name: "ВЛ 330 кВ Копорская – Кингисеппская", start: "ДИ ПС 750 кВ Копорская", end: "ДИ ПС 330 кВ Кингисеппская"},
	{name: "КВЛ 330 кВ Копорская – Ленинградская АЭС", start: "ДИ ПС 750 кВ Копорская", end: "НСС Ленинградской АЭС"},
	{name: "КВЛ 330 кВ Копорская – Пулковская", start: "ДИ ПС 750 кВ Копорская", end: "ДИ ПС 330 кВ Пулковская"},
	{name: "КВЛ 330 кВ Ленинградская – Кингисеппская", start: "ДИ ПС 750 кВ Ленинградская", end: "ДИ ПС 330 кВ Кингисеппская"},
	{name: "ВЛ 330 кВ Ленинградская – Колпино I цепь", start: "ДИ ПС 750 кВ Ленинградская", end: "ДИ ПС 330 кВ Колпино"},
	{name: "ВЛ 330 кВ Ленинградская – Колпино II цепь", start: "ДИ ПС 750 кВ Ленинградская", end: "ДИ ПС 330 кВ Колпино"},
	{name: "ВЛ 330 кВ Ленинградская – Чудово", start: "ДИ ПС 750 кВ Ленинградская", end: "ДД Новгородского РДУ"},
	{name: "ВЛ 330 кВ Ленинградская – Южная I цепь", start: "ДИ ПС 750 кВ Ленинградская", end: "ДИ ПС 330 кВ Южная"},
	{name: "ВЛ 330 кВ Ленинградская – Южная II цепь", start: "ДИ ПС 750 кВ Ленинградская", end: "ДИ ПС 330 кВ Южная"},
	{name: "КВЛ 330 кВ Ленинградская – Центральная", start: "ДИ ПС 750 кВ Ленинградская", end: "ДИ ПС 330 кВ Центральная"},
	{name: "ВЛ 330 кВ Ленинградская АЭС – Восточная", start: "ДИ Ленинградской АЭС", end: "ДИ ПС 330 кВ Восточная"},
	{name: "ВЛ 330 кВ Ленинградская АЭС – Гатчинская", start: "ДИ Ленинградской АЭС", end: "ДИ ПС 330 кВ Гатчинская"},
	{name: "ВЛ 330 кВ Ленинградская АЭС – Западная", start: "ДИ Ленинградской АЭС", end: "ДИ ПС 330 кВ Западная"},
	{name: "ВЛ 330 кВ Новосокольники – Талашкино", start: "ДД Новгородского РДУ", end: "ДД Тверского РДУ"},
	{name: "ВЛ 330 кВ Полоцк – Новосокольники (Л 345)", start: "ДД ГПО «Белэнерго»", end: "ДД Новгородского РДУ"},
	{name: "ВЛ 330 кВ Псков – Лужская", start: "ДД  Новгородского РДУ", end: "ДИ ПС 330 кВ Лужская"},
	{name: "ВЛ 330 кВ Псков – Тарту (Л-358)", start: "ДД  Новгородского РДУ", end: "ДД Elering AS"},
	{name: "КЛ 330 кВ Северная – Василеостровская", start: "ДИ ПС 330 кВ Северная", end: "ДИ ПС 330 кВ Василеостровская"},
	{name: "КВЛ 330 кВ Северная – Парнас", start: "ДИ ПС 330 кВ Северная", end: "ДИ ПС 330 кВ Парнас"},
	{name: "ВЛ 330 кВ Северо-Западная ТЭЦ – Восточная", start: "НСС Северо-Западной ТЭЦ", end: "ДИ ПС 330 кВ Восточная"},
	{name: "ВЛ 330 кВ Северо-Западная ТЭЦ – Выборгская", start: "НСС Северо-Западной ТЭЦ", end: "ДИ ПС 400 кВ Выборгская"},
	{name: "ВЛ 330 кВ Северо-Западная ТЭЦ – Зеленогорск", start: "НСС Северо-Западной ТЭЦ", end: "ДИ ПС 330 кВ Зеленогорск"},
	{name: "ВЛ 330 кВ Северо-Западная ТЭЦ – Северная", start: "НСС Северо-Западной ТЭЦ", end: "ДИ ПС 330 кВ Северная"},
	{name: "ВЛ 330 кВ Сясь – Петрозаводск", start: "ДИ ПС 330 кВ Сясь", end: "ДД Карельского РДУ"},
	{name: "ВЛ 330 кВ Чудово – Окуловская", start: "ДД Новгородского РДУ", end: "ДИ ПС 330 кВ Окуловская"},
	{name: "КВЛ 330 кВ Южная – Пулковская I цепь", start: "ДИ ПС 330 кВ Южная", end: "ДИ ПС 330 кВ Пулковская"},
	{name: "КЛ 330 кВ Южная – Пулковская №2", start: "ДИ ПС 330 кВ Южная", end: "ДИ ПС 330 кВ Пулковская"},
	{name: "КЛ 330 кВ Южная – Центральная", start: "ДИ ПС 330 кВ Южная", end: "ДИ ПС 330 кВ Центральная"},
	{name: "КЛ 330 кВ Южная ТЭЦ – Южная №1 (КБ-41)", start: "ДД Ленинградского РДУ", end: "ДИ ПС 330 кВ Южная"},
	{name: "КЛ 330 кВ Южная ТЭЦ – Южная №2 (КБ-4)", start: "ДД Ленинградского РДУ", end: "ДИ ПС 330 кВ Южная"},
]

let $in = document.getElementById('ice-cream-flavors'); // для списка
let $in_choice = document.getElementById('ice-cream-choice'); //выбор
let $zvk = document.getElementById('zvk');

let $off_bln = document.getElementById('off');
let $on_bln = document.getElementById('on');

let $time_set = document.getElementById('time_set');
let $output = document.getElementById('output');

function takeList() {
	lines_list.forEach((line) => {
		$in.insertAdjacentHTML('beforeend', `<option value="${line.name}">`);
	});
}
takeList()

$off_bln.addEventListener('click', apv_off);
$on_bln.addEventListener('click', apv_on);

function apv_off(){
	$on_bln.style.opacity = ".5";
	if ($in_choice.value != "") {
		for (let i of lines_list) {
			if ($in_choice.value == i.name) {
				$time_set.innerHTML = "";
				$time_set.insertAdjacentHTML('beforeend', `
					<table id="set_table">
			            <tr>
			                <td id='l1_1'>Отдана команда ${i.start}: </td>
			                <td><input type='time' id='l1_2'></td>
			                <td id='l1_3'>. Выполнено: </td>
			                <td><input type='time' id='l1_4'></td>
			            </tr>
			            <tr>
			                <td id='l2_1'>Отдана команда ${i.end}: </td>
			                <td><input type='time' id='l2_2'></td>
			                <td id='l2_3'>. Выполнено: </td>
			                <td><input type='time' id='l2_4'></td>
			            </tr>
			            <tr>
			                <td rowspan="3" id='l3_1'>Сообщено дисетчеру МЭС Северо-Запада: </td>
			                <td></td>
			                <td></td>
			                <td><input type='time' id='l3_2'></td>
			            </tr>
			        </table>
				`);
				function render(){
					$output.innerHTML = "";
					$output.insertAdjacentHTML('beforeend', `
						<textarea id="ej" rows="9">Для работ по заявке ${$zvk.value > 0 ? $zvk.value : ""} выведено ТАПВ / ОАПВ ${$in_choice.value}. Действие защит переведено на отключение 3-х фаз. На ключи управления выключателями вывешены плакаты "Работа под напряжением. Повторно не включать".\nВремя отдачи команды ${i.start}: ${document.getElementById('l1_2').value}. Время выполнения команды: ${document.getElementById('l1_4').value}.\nВремя отдачи команды ${i.end}: ${document.getElementById('l2_2').value}. Время выполнения команды: ${document.getElementById('l2_4').value}.\nСообщено диспетчеру МЭС С-З в ${document.getElementById('l3_2').value} и отдано разрешение на организацию производства работ в охранной зоне ${$in_choice.value}.</textarea>
						<button id="copy">Скопировать текст</button>
						`);
					document.getElementById('copy').addEventListener('click', copyText);
				}
				$time_set.addEventListener('keyup', render); // можно так? на один объект
				$time_set.addEventListener('click', render); // вешать 2 события?
			}
		}
	}
}


function apv_on(){
	$off_bln.style.opacity = ".5";
	if ($in_choice.value != "") {
		for (let i of lines_list) {
			if ($in_choice.value == i.name) {
				$time_set.innerHTML = "";
				$time_set.insertAdjacentHTML('beforeend', `
					<table id="set_table">
			            <tr>
			                <td id='l1_1'>Отдана команда ${i.start}: </td>
			                <td><input type='time' id='l1_2'></td>
			                <td id='l1_3'>. Выполнено: </td>
			                <td><input type='time' id='l1_4'></td>
			            </tr>
			            <tr>
			                <td id='l2_1'>Отдана команда ${i.end}: </td>
			                <td><input type='time' id='l2_2'></td>
			                <td id='l2_3'>. Выполнено: </td>
			                <td><input type='time' id='l2_4'></td>
			            </tr>
			            <tr>
			                <td rowspan="3" id='l3_1'>Сообщено дисетчеру МЭС Северо-Запада: </td>
			                <td></td>
			                <td></td>
			                <td><input type='time' id='l3_2'></td>
			            </tr>
			        </table>
				`);
				function render(){
					$output.innerHTML = "";
					$output.insertAdjacentHTML('beforeend', `
						<textarea id="ej" rows="9">После окончания работ по заявке ${$zvk.value > 0 ? $zvk.value : ""} введено ТАПВ / ОАПВ ${$in_choice.value}. Действие защит переведено на схему ОАПВ. С ключей управления выключателями сняты плакаты "Работа под напряжением. Повторно не включать".\nВремя отдачи команды ${i.start}: ${document.getElementById('l1_2').value}. Время выполнения команды: ${document.getElementById('l1_4').value}.\nВремя отдачи команды ${i.end}: ${document.getElementById('l2_2').value}. Время выполнения команды: ${document.getElementById('l2_4').value}.\nСообщено диспетчеру МЭС С-З в ${document.getElementById('l3_2').value}.</textarea>
						<button id="copy">Скопировать текст</button>
					`);
				}
				$time_set.addEventListener('keyup', render); // можно так? на один объект
				$time_set.addEventListener('click', render); // вешать 2 события?
			}
		}
	}
}


function copyText() {
	let copyedText = document.getElementById('ej');
	copyedText.select();
	document.execCommand("copy");
	let originalText = document.getElementById('copy').innerText;
	document.getElementById('copy').innerHTML = 'Готово!';
	setTimeout(() => {
		document.getElementById('copy').innerHTML = originalText;
	}, 1500);
}